<!DOCTYPE html>
<html lang="es">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="colores.css">
    <style>
        h1,
        h2,
        h3 {
            color: #ff0000;
        }
    </style>
    <title>Colores</title>
</head>

<body>

    <h1 style="color: blue;">Representación del texto y títulos </h1>
    <h2>El futuro de la Web</h2>
    <p>Muchas aplicaciones tradicionalmente de escritorio las podemos encontrar como aplicaciones Web: procesadores de
        texto, hojas de c&aacute;lculo, gesti&oacute;n de personal, facturaci&oacute;n, <abbr
            title="etcétera">etc</abbr>., incluso podemos encontrar completos sistemas operativos desarrollados como una
        aplicaci&oacute;n Web y con la que podemos trabajar utilizando un navegador. En marzo de 1949, en <cite>Popular
            Machanics</cite>, se dijo <q><abbr title="Electronic Numerical Integrator and Calculator">ENIAC</abbr>
            se equip&oacute; con 18.000 tubos de vac&iacute;o y pes&oacute; 30 toneladas, los computadores del futuro
            pueden tener 1.000 tubos de vac&iacute;o y quiz&aacute; pesen entre 1 y 1/2 toneladas.</q> Hoy vemos que el
        pron&oacute;stico fue ampliamente superado. La Web comenz&oacute; en la decada de los 90, &iquest;c&uacute;al
        ser&aacute; su futuro?</p>
    <h2><abbr title="Hypertext PreProcessor">PHP</abbr></h2>
    <h3>Definici&oacute;n</h3>
    <p>Para realizar el proyecto Web necesitaremos utilizar <abbr title="Hypertext PreProcessor">PHP</abbr>,
        definido en <cite>php.net</cite> como: </p>
    <blockquote cite="http://www.php.net"><strong><dfn><abbr title="Hypertext PreProcessor">PHP</abbr></dfn></strong>,
        <em>acr&oacute;nimo de "Hypertext
            Preprocessor"</em>, es un lenguaje "Open Source" interpretado de alto nivel, especialmente pensado para
        desarrollos web y el cual puede ser embebido en p&aacute;ginas <abbr
            title="HyperText Markup Language, Lenguaje para el Formato de Documentos de Hipertexto">HTML</abbr>. La
        mayor&iacute;a de su sintaxis es similar a C, Java y Perl y es f&aacute;cil de aprender. La meta de este
        lenguaje es permitir escribir a los creadores de p&aacute;ginas web, p&aacute;ginas din&aacute;micas de una
        manera r&aacute;pida y f&aacute;cil, aunque se pueda hacer mucho m&aacute;s con <abbr
            title="Hypertext PreProcessor">PHP</abbr>.
    </blockquote>
    <p>Existen m&uacute;ltiud de p&aacute;ginas en las que podemos encontrar informaci&oacute;n y ejemplos de PHP,
        adem&aacute;s la biblioteca del <abbr title="departamento">dpto</abbr>. dispone de varios ejemplares que tratan
        el desarrollo de p&aacute;ginas Web con <abbr title="Hypertext PreProcessor">PHP</abbr>.</p>
    <h3>Un primer ejemplo</h3>
    <p>Una respuesta corta y concisa, pero, &iquest;qu&eacute; significa realmente? Un ejemplo nos aclarar&aacute; las
        cosas:</p>
    <pre>
<code>
&lt;html&gt;
    &lt;head&gt;
        &lt;title&gt;Ejemplo&lt;/title&gt;
    &lt;/head&gt;
    &lt;body&gt;

        <strong>&lt;?php
        echo &#8220;Hola, &iexcl;soy un script PHP!&#8221;;
        ?&gt;</strong>
    &lt;/body&gt;
&lt;/html&gt;
</code>

</pre>
    <p>Al invocar al script anterior obtenemos la salida::</p>
    <div><samp> &#8220;Hola, &iexcl;soy un script PHP!&#8221;</samp></div>
    <p>Puede apreciarse que no es lo mismo que un script escrito en otro lenguaje de programaci&oacute;n como Perl o C
        -- En vez de escribir un programa con muchos comandos para crear una salida en <abbr
            title="HyperText Markup Language, Lenguaje para el Formato de Documentos de Hipertexto">HTML</abbr>,
        escribimos el c&oacute;digo <abbr
            title="HyperText Markup Language, Lenguaje para el Formato de Documentos de Hipertexto">HTML</abbr> con
        cierto c&oacute;digo <abbr title="Hypertext PreProcessor">PHP</abbr> embebido (incluido) en el mismo, que
        producir&aacute; cierta salida (en nuestro ejemplo, producir&aacute; un texto). El c&oacute;digo PHP se incluye
        entre etiquetas especiales de comienzo y final que nos permitir&aacute;n entrar y salir del modo <abbr
            title="Hypertext PreProcessor">PHP</abbr>. </p>
    <p> Lo que distingue a <abbr title="Hypertext PreProcessor">PHP</abbr> de la tecnolog&iacute;a Javascript, la
        cual se ejecuta en la m&aacute;quina cliente, es que el c&oacute;digo <abbr
            title="Hypertext PreProcessor">PHP</abbr> es ejecutado en el servidor. Si tuvi&eacute;semos un script
        similar al de nuestro ejemplo en nuestro servidor, el cliente solamente recibir&iacute;a el resultado de su
        ejecuci&oacute;n en el servidor, sin ninguna posibilidad de determinar qu&eacute; c&oacute;digo ha producido el
        resultado recibido. El servidor web puede ser incluso configurado para que procese todos los archivos <abbr
            title="HyperText Markup Language, Lenguaje para el Formato de Documentos de Hipertexto">HTML</abbr> con
        <abbr title="Hypertext PreProcessor">PHP</abbr>.
    </p>
    <p> Lo mejor de usar <abbr title="Hypertext PreProcessor">PHP</abbr> es que es extremadamente simple para el
        principiante, pero a su vez, ofrece muchas caracter&iacute;sticas avanzadas para los programadores
        profesionales.</p>
    <p> Aunque el desarrollo de <abbr title="Hypertext PreProcessor">PHP</abbr> est&aacute; concentrado en la
        programaci&oacute;n de scripts en el lado del servidor, se puede utilizar para muchas otras cosas. </p>
    <h3>Identificar la versi&oacute;n instalada</h3>
    <p>Para conocer la versi&oacute;n de <abbr title="Hypertext PreProcessor">PHP</abbr> que tienes instalada
        &#8212; es mejor opci&oacute;n crear una p&aacute;gina Web llamando a phpinfo() &#8212;, desde la l&iacute;nea
        de comandos teclea <kbd>php -v</kbd> Un ejemplo de lo que puedes obtener es:</p>
    <p><samp>PHP 5.2.0 (cli) (built: Nov 2 2006 11:57:36)<br>
            Copyright (c) 1997-2006 The PHP Group<br>
            Zend Engine v2.2.0, Copyright (c) 1998-2006 Zend Technologies</samp></p>
    <p>Nota: la orden anterior funcionar&aacute; independientemente del directorio activo en el que te encuentres
        siempre que la ruta al ejecutable PHP.EXE est&eacute; incluida en la variable <var>PATH</var></p>
    <h3>Bibliograf&iacute;a</h3>
    <p><cite>http://www.php.net</cite></p>
    <p>&nbsp;</p>
    <address>
        H<sup>3</sup>C<sub>A</sub>R &nbsp;&nbsp;&nbsp;S.L. <br>
        C\ Mi Dirección, s/n<br>
        10600 Plasencia<br>
        Tfno: 927 11 11 11</address>
</body>

</html>